Deep-Learning/MiMo-V2.5-Pro-on-MI300X-Benchmark/data/raw-logs/20260626-amd-aiter-mtp/benchmark_8192_con32.txt
/opt/venv/lib/python3.10/site-packages/transformers/modeling_rope_utils.py:1034: FutureWarning: `rope_config_validation` is deprecated and has been removed. Its functionality has been moved to RotaryEmbeddingConfigMixin.validate_rope method. PreTrainedConfig inherits this class, so please call self.validate_rope() instead. Also, make sure to use the new rope_parameters syntax. You can call self.standardize_rope_params() in the meantime.
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=40000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/data/xisun/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/MiMo-V2.5-Pro', served_model_name=None, tokenizer=None, num_prompts=256, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=32, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://0.0.0.0:40000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=40000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/data/xisun/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/MiMo-V2.5-Pro', served_model_name=None, tokenizer=None, num_prompts=256, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=32, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 2097152
#Output tokens: 262144
Starting warmup with 32 sequences...
Warmup completed with 32 sequences. Starting main benchmark run...
100%|██████████| 256/256 [04:17<00:00,  1.01s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     256       
Benchmark duration (s):                  257.62    
Total input tokens:                      2097152   
Total input text tokens:                 2097152   
Total generated tokens:                  262144    
Total generated tokens (retokenized):    261671    
Request throughput (req/s):              0.99      
Input token throughput (tok/s):          8140.64   
Output token throughput (tok/s):         1017.58   
Peak output token throughput (tok/s):    1178.00   
Peak concurrent requests:                36        
Total token throughput (tok/s):          9158.22   
Concurrency:                             30.57     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   30765.19  
Median E2E Latency (ms):                 30261.23  
P90 E2E Latency (ms):                    34234.23  
P95 E2E Latency (ms):                    38982.46  
P99 E2E Latency (ms):                    45204.71  
---------------Time to First Token----------------
Mean TTFT (ms):                          2183.87   
Median TTFT (ms):                        1083.90   
P90 TTFT (ms):                           4421.23   
P95 TTFT (ms):                           10311.13  
P99 TTFT (ms):                           15409.23  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          27.94     
Median TPOT (ms):                        28.15     
P90 TPOT (ms):                           30.18     
P95 TPOT (ms):                           31.01     
P99 TPOT (ms):                           32.34     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           27.94     
Median ITL (ms):                         31.37     
P90 ITL (ms):                            32.98     
P95 ITL (ms):                            33.90     
P99 ITL (ms):                            64.74     
Max ITL (ms):                            83.90     
==================================================